'''
Задача №2
В олімпіаді з інформатики брало участь кілька осіб.
Переможцем олімпіади стає людина, яка набрала найбільше балів.
Переможці визначаються незалежно по кожному класу.
Визначте кількість балів, яку набрав переможець в кожному класі.
Гарантується, що в кожному класі був хоча б один учасник.
Інформація про результати олімпіади записана у файлі,
кожен рядок якого має вигляд: прізвище ім’я клас бал.
Прізвище та ім’я - текстові рядки, що не містять пропусків.
Клас - одне з трьох чисел 9, 10, 11. Бал - ціле число від 0 до 100.
У інший файл запишіть три числа в одному рядку через пропуск: бали переможця олімпіади з 9 класу,
з 10 класу, з 11 класу.

Вхідні дані:
Файл input.txt з вмістом
Albert Einstein 9 90
Ernest Rutherford 10 91
Lev Landau 11 92
Enrico Fermi 9 93
Вихідні дані:
Файл output.txt з вмістом
93 91 92

Автор: Задворна Анастасія Богданівна
'''

with open('input.txt', 'r') as file:
    lines = file.readlines()

max_scores = {'9': 0, '10': 0, '11': 0}

for line in lines:
    name, _, class_num, score = line.split()

    if int(score) > max_scores[class_num]:
        max_scores[class_num] = int(score)

with open('output.txt', 'w') as file:
    file.write(f"{max_scores['9']} {max_scores['10']} {max_scores['11']}")
